app/controllers/home_controller.rb

  def index
    @featured = Tax.all(:order => 'id desc', :limit => 6, :conditions => {:status => Tax::ACTIVE})
---
SELECT `taxes`.* FROM `taxes` WHERE (`taxes`.`status` = 1) ORDER BY id desc LIMIT 6

  def widget
    @tax = Tax.find(params[:id])
---
SELECT `taxes`.* FROM `taxes` WHERE (`taxes`.`id` = 5) LIMIT 1